[{"name":"La Haine","img":"https://yc.cldmlk.com/jrvyz6cav5m2kaq1mqmsb7ag7r/uploads/vertical_d74dac80-9a59-4611-b340-6c256b0cb334.jpg","director":"Mathieu Kassovitz","releaseYear":1995,"rating":4,"review":"I'm really discovering the kind of FILM I love. This fits right into that.","type":"FILM"},{"name":"In Bruges","img":"https://m.media-amazon.com/images/I/914V9NgA8FL._AC_UF1000,1000_QL80_.jpg","director":"Martin McDonagh","releaseYear":2008,"rating":3,"review":"Very fun and silly. Cool to see Collin Farrell and Brendan Gleeson in a FILM so different to Banshees of Inesherin. Maybe didn't live up to the hype though.","type":"FILM"},{"name":"Maurice","img":"https://m.media-amazon.com/images/I/91ZXcY6d4vL._AC_UF894,1000_QL80_.jpg","author":"E.M. Forster","releaseYear":1970,"rating":4,"review":"My second classic, after Dorian Grey. I could say lots more about this BOOK than I can be bothered to write here. The beginning, and Maurice falling in love with Clive, was very sweet and relatable. Later parts of the story gave more social commentary than I expected, as I found with Dorian Grey. I particularily liked the afternote, and it's description of how the story ignored WW2 and was set in the last time when it was possible to \"run into the hills\" in England.","type":"BOOK"},{"name":"The Lord pf the Rings: The Appendices","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/BOOKs/1330965881i/10807253.jpg","author":"J.R.R. Tolkien","releaseYear":1955,"rating":4,"review":"Was really excited for this during my reread of the trilogy, as I skipped it on my first read many years ago. Ended up skipping lots of it again... mostly really tedious stuff like notes on translation. I did enjoy the longer more narrative bits though, and liked how it was written by in-world sources.","type":"BOOK"},{"name":"The Last Duel","img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ_zRMmaYc85XGNlEJJk4pDv-tXYkzIy1KhuTEYQRuYldxFMprEATcHsUHqSZWmxK1VuAloyw","director":"Ridley Scott","releaseYear":2021,"rating":4,"review":"Giving Ridley Scott another chance at a historical drama after Napoleon and ahead of Gladiator 2, and I'm glad I did. Of all the things I expected from this FILM, a feminist message about patriarchy in medieval times (still very applicable today) and listening to women's voices in rape cases wasn't one of them. I saw a review on Letterboxd dismissing it as a juvenile attempt at a \"what if we actually listened to women\" story but it's something I've never seen in the genre before and something I think is very needed","type":"FILM"},{"name":"The Godfather","img":"https://m.media-amazon.com/images/M/MV5BYTJkNGQyZDgtZDQ0NC00MDM0LWEzZWQtYzUzZDEwMDljZWNjXkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg","director":"Francis Ford Coppola","releaseYear":1972,"rating":4,"review":"Finally got round to this now it's on streaming. Maybbee didn't quite live up to the hype but only since that's a very tall order for a FILM often quoted as the GOAT. I did however really enjoy it, and it's grown on me even more since watching it.","type":"FILM"},{"name":"As Good As It Gets","img":"https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcQrwjQB8-7HH2EgNxk6DPF3RTQ_lq957fP4dC66yhOWK1f-0VBLiofu-HvaF5OVmCEuESvxfg","director":"James L. Brooks","releaseYear":1997,"rating":3,"review":"A recomendation from Martina. Really fun, great characters ,Jack Nicholson was great. Suprised how much the FILM made me laugh out loud. Some of the jokes would not fly today but I don't know if you could make an actual case against them today, I guess just not needed.","type":"FILM"},{"name":"Ants From Up There","img":"https://f4.bcbits.com/img/a3874459819_10.jpg","artist":"Black Country, New Road","releaseYear":2022,"rating":4,"review":"Recomendation from Emily. I listened to this on a flight during the descent into Rome Ciampino, quite fitting. Feels like music for closeted theatre boys and I'm here for it. Whenever I'm home alone I find myself shouting \"She had Billie Eilish style\" in my best 2000s emo voice, for some reason.","type":"ALBUM"},{"name":"Air Max Plus 3","img":"https://static.nike.com/a/images/t_PDP_1728_v1/f_auto,q_auto:eco/aqcdmfttkq4cuvv9nuwx/AIR+MAX+PLUS+III.png","brand":"Nike","price":174.99,"link":"https://www.nike.com/gb/t/air-max-plus-iii-shoes-mJkmzK","type":"WISHLIST"},{"name":"The Death of Stalin","img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRWKmjAuI_ccZ9htSy6Rder-WwAE-UOLSF6fwLT9XE0v37P8rDA","director":"Armando Iannucci","releaseYear":2017,"rating":3,"review":"Great cast and could tell they had a lot of fun making it. I correctly guessed that my mum was a fan of it, and she hates most FILMs. I did really enjoy it, but it got a bit tired towards the end.","type":"FILM"},{"name":"Small Things Like These","img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSPpB462o3YmgSSa5ZhEwUSqyzbLkdiC02Vig&s","director":"Tim Mielants","releaseYear":2024,"rating":3,"review":"Had nothing to do on a Saturday night and so decided to take my parents to the cinema, and this was the only thing showing that drew me in. The FILM was very slow, but I enjoyed Cillian Murphy, the setting (similar to Starve Acre in a way, I enjoy the familiarity), and the cinematography were great. However, I feel stupid to admit that I was pretty confused throughout the FILM and needed my mum to explain it afterwards, as I had never heard of the Magdalene Laundries. I think in a way I satisfied some of the motivation behind Cillian making this FILM as the debut of his studio, as when I got home I read the Wikipedia page for the Magdalene laundries and did some learning. Horrific stuff.","type":"FILM"},{"name":"Taxi Driver","img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQS_MWAGYS7qxHX4bwKT0TyTrJ6mB6V1DYrarKoOvjw2gvnGly7T5-Pt6B_uH7HOZd-O_KP","director":"Martin Scorsese","releaseYear":1976,"rating":4,"review":"A meadering and uneventful plot driven by captivating characters and iconic visuals, my favourite genre. People like this don't exist in real life, but the acting and dialogue transport you to a world where they do, and you're left grappling with the morals you know to struggle to reason with the characters.","type":"FILM"},{"name":"GNX","img":"https://best-fit.transforms.svdcdn.com/production/ALBUMs/Kendrick-Lamar-GNX-cover.jpg?w=469&h=469&q=100&auto=format&fit=crop&dm=1732353435&s=d8eebc757decc24a11a0d89b3cc31b5b","artist":"Kendrick Lamar","releaseYear":2024,"rating":4,"review":"Thank you Kendrick for letting me stan Jack Antonoff without being embarassed.","type":"ALBUM"},{"name":"Dead Poets Society","img":"https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcT6VlN70gPF17NME9EjCEeX1zIE8oW3wAl1Lzj_W9VCBqLbsATYCU_lHH4aNdFNF4Q8UU12WQ","director":"Peter Weir","releaseYear":1989,"rating":4,"review":"Just so charming and heartwarming. So much comfort FILM potential, and it would probably do me a lot of good to watch this once a year. Such a breath of fresh air to actually like and understand the choices of characters I'm meant to relate to in a FILM. The positive masculnity in this made me want to get the boys together to read eachother poems, and we'll all listen attentatively and aplaud one another. Wonderfully, I have friends who make this not a far cry. Also made me think I would make a great teacher, and I'm so lucky to have parents who encouraged me to do whatever I wanted. Martina recently told me I looked like Ethan Hawke in a photo, and it's becoming one of my favourite compliments.","type":"FILM"},{"name":"Stripes Pants","img":"https://pushpushww.com/cdn/shop/files/ScreenShot2024-06-01at15.56.04_33b674b6-4bc3-4e1c-ab56-a453dbe06298.png?v=1717561718&width=1470","brand":"Push Push","price":47,"link":"https://pushpushww.com/collections/pants/products/pp-stripes-pants-pre-order","type":"WISHLIST"},{"name":"TD-3-AM","img":"https://r2.gear4music.com/media/53/533335/1200/preview_1.jpg","brand":"Behringer","price":89,"link":"https://www.gear4music.com/Keyboards-and-Pianos/Behringer-TD-3-AM-Analog-Bass-Line-Synthesizer-LTD-Yellow/3A8Y?origin=product-ads&gad_source=1&gclid=Cj0KCQiAuou6BhDhARIsAIfgrn6Tcq-mIN6mDRWPubhQi0By6MQA8rRbSsUj6X6WziqO5fAi2pYZkVEaAv1UEALw_wcB","type":"WISHLIST"},{"name":"New film","img":"New image","director":"New Director","releaseYear":0,"rating":0,"review":"New review","type":"FILM"},{"name":"Nineteen Eighty-Four","img":"https://cdn.waterstones.com/bookjackets/large/9780/1411/9780141187761.jpg","author":"George Orwell","releaseYear":1949,"rating":3,"review":"A really clear and consise yet comprehensive and suprisingly human way of conveying such a huge and poignant idea. It was sometimes painfully on-the-nose and swaying between I'm 14 and this is deep and That Mitchell and Webb Look's emergency broadcast gameshow, but this could just be an effect of how prophetic it turned out to be. I found the more nuanced themes like sex and philology helped soften this too, for example contrast Winston and Julia's time in the glade to the excutiating exerpts from Goldstein's manifesto which I probably would have expected to like more. It also weirdly read a lot like Dune with the huge dumps of inner monologue and perspective, as well as the retro-futuristic elements. One thing I kept thinking throughout was why would anyone not want to just be a prole? Their lives sound infinitely better. Overall though, I'd say my opinion of the government hasn't changed much.","type":"BOOK"}]